# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'claude'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew "drush"             
brew "php"              
brew "composer"          
brew "php-cs-fixer"       # Code style fixer
brew "phpstan"            # Static analysis


# Development
brew 'imagemagick'
brew 'yarn'
brew "phpcs"              # PHP CodeSniffer for Drupal standards


# Apps
cask 'caffeine'
cask 'orbstack'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'github'
cask 'google-chrome'
cask 'helo' #email test and debug
cask 'imageoptim' #bulk image compression
cask 'postman'
cask 'slack'
cask 'tableplus' #db table gui https://tableplus.com/
cask 'the-unarchiver' #https://theunarchiver.com/
cask 'transmit' #Mac specific file transfer https://panic.com/transmit/
cask 'visual-studio-code'
cask 'chromedriver'      # Selenium testing
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

