# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'claude'
brew 'gh'
brew 'git'
brew 'grep'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts 
brew "php"              
brew "composer"          
brew "php-cs-fixer"       # Code style fixer
brew "phpstan"            # Static analysis


# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'orbstack'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'postman'
cask 'slack'
cask 'chromedriver'      # Selenium testing

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'


